fubingyan2026/stm32_workspace_/E1_SLAVER_POWER_CTU/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2026 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define AUX_POWER_ADC_Pin GPIO_PIN_0
#define AUX_POWER_ADC_GPIO_Port GPIOC
#define MOTOR_POWER_ADC_Pin GPIO_PIN_1
#define MOTOR_POWER_ADC_GPIO_Port GPIOC
#define LSD1_ADC_Pin GPIO_PIN_2
#define LSD1_ADC_GPIO_Port GPIOC
#define LSD2_ADC_Pin GPIO_PIN_3
#define LSD2_ADC_GPIO_Port GPIOC
#define DC_DC_EN_Pin GPIO_PIN_0
#define DC_DC_EN_GPIO_Port GPIOA
#define EXT_PCOOG_24V_Pin GPIO_PIN_1
#define EXT_PCOOG_24V_GPIO_Port GPIOA
#define LSD1_IN_Pin GPIO_PIN_2
#define LSD1_IN_GPIO_Port GPIOA
#define LSD2_IN_Pin GPIO_PIN_3
#define LSD2_IN_GPIO_Port GPIOA
#define ISO_EN_12V_Pin GPIO_PIN_4
#define ISO_EN_12V_GPIO_Port GPIOA
#define ISO_PGOOD_12V_Pin GPIO_PIN_5
#define ISO_PGOOD_12V_GPIO_Port GPIOA
#define RS485_EN_Pin GPIO_PIN_5
#define RS485_EN_GPIO_Port GPIOC
#define RS485_TX_Pin GPIO_PIN_10
#define RS485_TX_GPIO_Port GPIOB
#define RS485_RX_Pin GPIO_PIN_11
#define RS485_RX_GPIO_Port GPIOB
#define LOG_UART_TX_Pin GPIO_PIN_9
#define LOG_UART_TX_GPIO_Port GPIOA
#define LOG_UART_RX_Pin GPIO_PIN_10
#define LOG_UART_RX_GPIO_Port GPIOA
#define LED_PWM_Pin GPIO_PIN_6
#define LED_PWM_GPIO_Port GPIOB
#define FILL_LED_PWM_Pin GPIO_PIN_8
#define FILL_LED_PWM_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
